<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"2ad30f39be2d97d6cffc1ee7dd176464a4aedeca0d129b8a5968dd788ba11d02","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1131 at https://github.com/cal-itp/data-infra/actions/runs/19945785324","plan_out_hash":"c07ad6c722d7ed2d112cbfb90af1d47bf88b62095662718d0e8d363716050ddb","plan_hash":"dc23638f7ae0b5396112c11c9b13330c084908e24fba95e93534ea7d1b0e7739","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 13 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/dags.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "3xr3Zg==" -> (known after apply)
!~      detect_md5hash      = "BFTZSEOaU75gFCHcwbHOHg==" -> "different hash"
!~      generation          = 1764100045313355 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dags.py"
!~      md5hash             = "BFTZSEOaU75gFCHcwbHOHg==" -> (known after apply)
        name                = "dags/dags.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/download_parse_and_validate_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "s7gutw==" -> (known after apply)
!~      detect_md5hash      = "dZZ/3dsMDhV45nOmOfaxRQ==" -> "different hash"
!~      generation          = 1764720235185955 -> (known after apply)
        id                  = "calitp-staging-composer-dags/download_parse_and_validate_gtfs.py"
!~      md5hash             = "dZZ/3dsMDhV45nOmOfaxRQ==" -> (known after apply)
        name                = "dags/download_parse_and_validate_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "nZT1rg==" -> (known after apply)
!~      detect_md5hash      = "2saiTZvCLrcNPqgDyMW4jg==" -> "different hash"
!~      generation          = 1764012980280721 -> (known after apply)
        id                  = "calitp-staging-composer-dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml"
!~      md5hash             = "2saiTZvCLrcNPqgDyMW4jg==" -> (known after apply)
        name                = "dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar"] will be destroyed
  # (because key ["plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/zip" -> null
-       crc32c              = "1hT7ow==" -> null
-       detect_md5hash      = "omifem08VTXEfwdktvRcLQ==" -> null
-       event_based_hold    = false -> null
-       generation          = 1764720241445065 -> null
-       id                  = "calitp-staging-composer-plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar" -> null
-       md5hash             = "omifem08VTXEfwdktvRcLQ==" -> null
-       md5hexhash          = "a2689f7a6d3c5535c47f0764b6f45c2d" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Fgtfs_validator%2Fgtfs-validator-7.1.0-cli.jar?generation=1764720241445065&alt=media" -> null
-       metadata            = {} -> null
-       name                = "plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar" -> null
-       output_name         = "plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Fgtfs_validator%2Fgtfs-validator-7.1.0-cli.jar" -> null
-       source              = "../../../../airflow/plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_validator_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "MJdUzA==" -> (known after apply)
!~      detect_md5hash      = "KQe6F2Pg00lgiDvRJczyIg==" -> "different hash"
!~      generation          = 1764720235183656 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_validator_hook.py"
!~      md5hash             = "KQe6F2Pg00lgiDvRJczyIg==" -> (known after apply)
        name                = "plugins/hooks/gtfs_validator_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/bigquery_to_download_config_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "KvENpw==" -> (known after apply)
!~      detect_md5hash      = "T4VqE/DM0g8dGIROGUZ4Ww==" -> "different hash"
!~      generation          = 1764720235202890 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/bigquery_to_download_config_operator.py"
!~      md5hash             = "T4VqE/DM0g8dGIROGUZ4Ww==" -> (known after apply)
        name                = "plugins/operators/bigquery_to_download_config_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "q+Eqyg==" -> (known after apply)
!~      detect_md5hash      = "kuVQXWLAe56hVXCtUay2fw==" -> "different hash"
!~      generation          = 1764720235189696 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "kuVQXWLAe56hVXCtUay2fw==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/unzip_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "cR3bKA==" -> (known after apply)
!~      detect_md5hash      = "dFpsoptt00kw9KcQmcFUZQ==" -> "different hash"
!~      generation          = 1764720235201641 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/unzip_gtfs_to_gcs_operator.py"
!~      md5hash             = "dFpsoptt00kw9KcQmcFUZQ==" -> (known after apply)
        name                = "plugins/operators/unzip_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/validate_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "fuB0Fg==" -> (known after apply)
!~      detect_md5hash      = "yKJ9z3QNM6BodQPUtMjbjw==" -> "different hash"
!~      generation          = 1764720235191074 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/validate_gtfs_to_gcs_operator.py"
!~      md5hash             = "yKJ9z3QNM6BodQPUtMjbjw==" -> (known after apply)
        name                = "plugins/operators/validate_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "EsypDQ==" -> (known after apply)
!~      detect_md5hash      = "RvOTRN37wdJwjRjyNVkfYw==" -> "different hash"
!~      generation          = 1764720236523983 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "RvOTRN37wdJwjRjyNVkfYw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs_quality/int_gtfs_quality__schedule_validator_rule_details_unioned.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "YsCCRQ==" -> (known after apply)
!~      detect_md5hash      = "iAgoxsODiNGBSyjj5CGUqQ==" -> "different hash"
!~      generation          = 1764012980637089 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__schedule_validator_rule_details_unioned.sql"
!~      md5hash             = "iAgoxsODiNGBSyjj5CGUqQ==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__schedule_validator_rule_details_unioned.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/benefits/fct_benefits_events.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "AmoX1g==" -> (known after apply)
!~      detect_md5hash      = "32e2YxZ8YVVpaVcbMfrV+w==" -> "different hash"
!~      generation          = 1762380824121196 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/benefits/fct_benefits_events.sql"
!~      md5hash             = "32e2YxZ8YVVpaVcbMfrV+w==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/fct_benefits_events.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs_quality/_mart_gtfs_quality.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "BBRphw==" -> (known after apply)
!~      detect_md5hash      = "CCyI4Zj5M356wg/WJd/DRQ==" -> "different hash"
!~      generation          = 1764012980662153 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs_quality/_mart_gtfs_quality.yml"
!~      md5hash             = "CCyI4Zj5M356wg/WJd/DRQ==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_quality/_mart_gtfs_quality.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv"] will be destroyed
  # (because key ["seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "HiMSzg==" -> null
-       detect_md5hash      = "REBfI/kjd8XOSStDQgOZEg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1764012980587419 -> null
-       id                  = "calitp-staging-composer-data/warehouse/seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv" -> null
-       md5hash             = "REBfI/kjd8XOSStDQgOZEg==" -> null
-       md5hexhash          = "44405f23f92377c5ce492b4342039912" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fseeds%2Fgtfs_schedule_validator_rule_details_v7_1_0.csv?generation=1764012980587419&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv" -> null
-       output_name         = "data/warehouse/seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fseeds%2Fgtfs_schedule_validator_rule_details_v7_1_0.csv" -> null
-       source              = "../../../../warehouse/seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "VyAxDg==" -> (known after apply)
!~      detect_md5hash      = "wymN8j1T3K10x0O7e+8Tvw==" -> "different hash"
!~      generation          = 1764720239300427 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "wymN8j1T3K10x0O7e+8Tvw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 13 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1131](https://github.com/cal-itp/data-infra/actions/runs/19945785324)